require "set"

# Patch brew and cask to skip any packages listed in HOMEBREW_SKIP_PACKAGES.
SKIP = ENV.fetch("HOMEBREW_SKIP_PACKAGES", "")
           .split(/[, ]+/).map(&:strip).reject(&:empty?).to_set

module SkipPackages
    def brew(name, *args, **opts, &blk)
        SKIP.include?(name) ? puts("Skipping #{name}") : super
    end

    def cask(name, *args, **opts, &blk)
        SKIP.include?(name) ? puts("Skipping #{name}") : super
    end
end

Homebrew::Bundle::Dsl.prepend(SkipPackages)


brew "direnv"
brew "fzf"
cask "iterm2"
brew "just"
brew "tmux"
brew "tree"
brew "watch"

cask "emacs-app"

brew "git"
brew "gh"

brew "duckdb"
brew "sqlite3"

brew "python"
brew "uv"

brew "fnm"

brew "pandoc"

brew "docker"
brew "docker-buildx"
cask "docker-desktop"

cask "claude-code"
cask "codex"
